## Production: alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 3 to add, 3 to change, 3 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.route53_ddos will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "route53_ddos" {
        id                        = "Route53DDoS"
      ~ ok_actions                = [
          + "",
          - "arn:aws:sns:us-east-1:957818836222:alert-ok",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_lambda_permission.notify_slack_critical must be replaced
-/+ resource "aws_lambda_permission" "notify_slack_critical" {
      ~ function_name = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlackSNS" -> "NotifySlackSNS" # forces replacement
      ~ id            = "AllowExecutionFromSNSCriticalAlert" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.notify_slack_ok_us_east must be replaced
-/+ resource "aws_lambda_permission" "notify_slack_ok_us_east" {
      ~ id            = "AllowExecutionFromSNSOkAlertUSEast" -> (known after apply)
      - source_arn    = "arn:aws:sns:us-east-1:957818836222:alert-ok" -> null # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.cloudwatch_events_critical_sns will be updated in-place
  ~ resource "aws_sns_topic_policy" "cloudwatch_events_critical_sns" {
        id     = "arn:aws:sns:ca-central-1:957818836222:alert-critical"
      ~ policy = jsonencode(
          ~ {
              - Id        = "__default_policy_ID" -> null
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "SNS:GetTopicAttributes",
                          + "SNS:Subscribe",
                            "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                            "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                            "SNS:Receive",
                          + "SNS:Publish",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:GetTopicAttributes",
                          + "SNS:DeleteTopic",
                          + "SNS:AddPermission",
                        ]
                      ~ Condition = {
                          ~ StringEquals = {
                              ~ AWS:SourceOwner = "957818836222" -> [
                                  + "957818836222",
                                ]
                            }
                        }
                      ~ Resource  = "arn:aws:sns:ca-central-1:957818836222:alert-critical" -> "*"
                      ~ Sid       = "__default_statement_ID" -> "SNS_Default_Policy"
                        # (2 unchanged elements hidden)
                    },
                  + {
                      + Action    = "sns:Publish"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Publish_statement"
                    },
                ]
              ~ Version   = "2008-10-17" -> "2012-10-17"
            }
        )
        # (2 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.topic_critical will be updated in-place
  ~ resource "aws_sns_topic_subscription" "topic_critical" {
      + confirmation_timeout_in_minutes = 1
      + endpoint_auto_confirms          = false
        id                              = "arn:aws:sns:ca-central-1:957818836222:alert-critical:ac79de1f-8ce4-488e-b5ab-305a2c1adb8f"
        # (8 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.topic_ok_us_east must be replaced
-/+ resource "aws_sns_topic_subscription" "topic_ok_us_east" {
      ~ arn                             = "arn:aws:sns:us-east-1:957818836222:alert-ok:af7ae647-9e45-4bc2-8f29-11028eadd437" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:957818836222:alert-ok:af7ae647-9e45-4bc2-8f29-11028eadd437" -> (known after apply)
      ~ owner_id                        = "957818836222" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      - topic_arn                       = "arn:aws:sns:us-east-1:957818836222:alert-ok" -> null # forces replacement
        # (5 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos"]

10 tests, 8 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
